Fese673/ZEGAR-ESP32/src/main.cpp
  introPrintBorderLine(0, '.', '.');
  LCD_SET(0, 1);
  LCD_PRINT(F("|"));
  LCD_PRINT(row1);
  LCD_PRINT(F("|"));
  LCD_SET(0, 2);
  LCD_PRINT(F("|"));
  LCD_PRINT(row2);
  LCD_PRINT(F("|"));
  introPrintBorderLine(3, '\'', '\'');
  LCD_DUMP();
}

static void introBegin() {
  randomSeed((uint32_t)micros());
  s_intro = BootIntroState{};
  s_intro.phase = IntroPhase::Noise;
  s_intro.phaseStartedMs = millis();
  s_intro.backlightOn = true;
}

static bool serviceEpicBootSequence() {
  if (s_intro.phase == IntroPhase::Idle || s_intro.phase == IntroPhase::Done) {
    return false;
  }

  const unsigned long nowMs = millis();
  switch (s_intro.phase) {
    case IntroPhase::Noise:
      if (s_intro.lastNoiseMs == 0 || (nowMs - s_intro.lastNoiseMs) >= 90UL) {
        introRenderNoiseFrame();
        s_intro.lastNoiseMs = nowMs;
      }
      if ((nowMs - s_intro.phaseStartedMs) >= 1800UL) {
        renderAuthIntroFrame();
        tone(BUZZER_PIN, 1760, 70);
        s_intro.phase = IntroPhase::AuthHold;
        s_intro.phaseStartedMs = nowMs;
      }
      break;

    case IntroPhase::AuthHold:
      if ((nowMs - s_intro.phaseStartedMs) >= 3000UL) {
        s_intro.phase = IntroPhase::FrameBuild;
        s_intro.phaseStartedMs = nowMs;
      }
      break;

    case IntroPhase::FrameBuild:
      renderTickingFrameBase();
      tone(BUZZER_PIN, 140, 120);
      s_intro.revealIndex = 0;
      s_intro.phase = IntroPhase::Reveal;
      s_intro.phaseStartedMs = nowMs;
      s_intro.lastRevealMs = nowMs;
      break;

    case IntroPhase::Reveal:
      if ((nowMs - s_intro.lastRevealMs) >= 200UL) {
        ++s_intro.revealIndex;
        renderTickingFrameText(s_intro.revealIndex);
        tone(BUZZER_PIN, (uint16_t)(145 + (s_intro.revealIndex * 14U)), 160);
        s_intro.lastRevealMs = nowMs;
      }
      if (s_intro.revealIndex >= 11) {
        s_intro.phase = IntroPhase::FlashOn;
        s_intro.flashStartedMs = nowMs;
        s_intro.flashCount = 0;
        s_intro.backlightOn = true;
        renderTickingFrameText(11);
        lcd.backlight();
      }
      break;

    case IntroPhase::FlashOn:
      if (!s_intro.backlightOn) {
        lcd.backlight();
        s_intro.backlightOn = true;
      }
      if ((nowMs - s_intro.flashStartedMs) >= 110UL) {
        s_intro.phase = IntroPhase::FlashOff;
        s_intro.flashStartedMs = nowMs;
      }
      break;

    case IntroPhase::FlashOff:
      if (s_intro.backlightOn) {
        lcd.noBacklight();
        s_intro.backlightOn = false;
      }
      if ((nowMs - s_intro.flashStartedMs) >= 90UL) {
        ++s_intro.flashCount;
        if (s_intro.flashCount >= 3) {
          lcd.backlight();
          s_intro.backlightOn = true;
          introPrintBorderLine(0, '.', '.');
          introPrintCentered(1, "SYSTEM READY");
          introPrintPaddedLine(2, "                  ");
          introPrintBorderLine(3, '\'', '\'');
          LCD_DUMP();
          tone(BUZZER_PIN, 523, 90);
          s_intro.phase = IntroPhase::SuccessReady;
          s_intro.phaseStartedMs = nowMs;
        } else {
          s_intro.phase = IntroPhase::FlashOn;
          s_intro.flashStartedMs = nowMs;
        }
      }
      break;

    case IntroPhase::SuccessReady:
      if ((nowMs - s_intro.phaseStartedMs) >= 300UL) {
        s_intro.phase = IntroPhase::SuccessRiff;
        s_intro.riffStartedMs = nowMs;
        s_intro.riffIndex = 0;
      }
      break;

    case IntroPhase::SuccessRiff: {
      static const uint16_t kNotes[] = {523, 659, 784, 1047, 1319};
      static const uint16_t kDurationsMs[] = {120, 100, 95, 85, 180};

      if (s_intro.riffIndex == 0) {
        tone(BUZZER_PIN, kNotes[0], kDurationsMs[0]);
        s_intro.riffStartedMs = nowMs;
        ++s_intro.riffIndex;
      } else if (s_intro.riffIndex < 5 && (nowMs - s_intro.riffStartedMs) >= kDurationsMs[s_intro.riffIndex - 1]) {
        tone(BUZZER_PIN, kNotes[s_intro.riffIndex], kDurationsMs[s_intro.riffIndex]);
        s_intro.riffStartedMs = nowMs;
        ++s_intro.riffIndex;
      } else if (s_intro.riffIndex >= 5 && (nowMs - s_intro.riffStartedMs) >= 220UL) {
        noTone(BUZZER_PIN);
        s_intro.phase = IntroPhase::Done;
      }
      break;
    }

    case IntroPhase::Done:
    case IntroPhase::Idle:
    default:
      return false;
  }

  return s_intro.phase != IntroPhase::Done;
}

Preferences s_prefs;
bool showEpicIntro = true;
int settingsEpicIntroIndex = 0;
int settingsEpicIntroMenuCount = 2;
const char* settingsEpicIntroItems[] = {"ON", "OFF"};

constexpr unsigned long SETUP_DELAY_MS      = 100;  // cooperative startup wait for serial init
constexpr long UART_BAUD = 921600;
HardwareSerial& uart = Serial2;
static uint32_t heapBaseline = 0;
int settingsUiScreenIndex = 0;
int settingsAlarmMelodyIndex = 0;
int s_prevSettingsAlarmMelodyIndex = 0;
constexpr uint8_t ENC_CLK = BoardPins::kEncoderClk;
constexpr uint8_t ENC_DT  = BoardPins::kEncoderDt;
constexpr uint8_t ENC_SW  = BoardPins::kEncoderSw;

static String s_wifiSsid = PROJECT_WIFI_SSID;
static String s_wifiPass = PROJECT_WIFI_PASS;
static String s_ntpServer = PROJECT_NTP_SERVER;
static MQTTSync::Config s_mqttConfig;

constexpr int BMP280_MENU_COUNT = 4;
int bmp280MenuCount = BMP280_MENU_COUNT;

// --- Menu Główne ---
int menuIndex = 0;
const char* menuItems[] = {
  "Ustaw czas",
  "Minutnik",
  "Stoper",
  "Budzik",
  "Statystyki",
  "Debug STM32",
  "PMS5003",
  "AHT21 + ENS160",
  "BMP280",
  "Ustawienia",
  "Wyjscie",
  "Tryb radia"
};
constexpr int MENU_COUNT = 12;
int menuCount = MENU_COUNT;

// --- Menu Statystyk ---
int statsMenuIndex = 0;
const char* statsMenuItems[] = {
  "Kliki",
  "Kroki",
  "Temp min/max",
  "Wilg min/max",
  "Ram Free",
  "Heap",
  "Flash Free"
};
constexpr int STATS_MENU_COUNT = 7;
int statsMenuCount = STATS_MENU_COUNT;

// --- Menu Zasobów Systemu ---
int resourcesMenuIndex = 0;
const char* resourcesMenuItems[] = {
  "RAM Free",
  "Heap",
  "Flash Free"
};
constexpr int RESOURCES_MENU_COUNT = 3;
int resourcesMenuCount = RESOURCES_MENU_COUNT;

