Fese673/ZEGAR-ESP32/src/main.cpp
// --- Menu ENS160 + AHT21 ---
int ens160MenuIndex = 0;
const char* ens160MenuItems[] = {
  "AQI",
  "TVOC",
  "eCO2",
};
constexpr int ENS160_MENU_COUNT = 3;
int ens160MenuCount = ENS160_MENU_COUNT;

// --- Menu BMP280 ---
int bmp280MenuIndex = 0;
const char* bmp280MenuItems[] = {
  "Temperature",
  "Pressure",
  "Status",
  "Altitude"
};

// --- Menu Ustawień ---
int settingsMenuIndex = 0;
const char* settingsMenuItems[] = {
  "PMS5003",
  "Buzzer",
  "MQTT",
  "Alarmy",
  "Synchronizacja",
  "Rotacja Ekranu",
  "UI ekran",
  "Boot Intro",
  "Wyjscie"
};
constexpr int SETTINGS_MENU_COUNT = 9;
int settingsMenuCount = SETTINGS_MENU_COUNT;

// --- Menu: Synchronizacja ---
int settingsSyncMinutes = 60;
int s_prevSettingsSyncMin = 60;

// --- Menu Ustawienia UI EKRAN ---
const char* settingsUiScreenItems[] = {
  "Minimal",
  "Balanced",
  "Extreme"
};
constexpr int SETTINGS_UI_SCREEN_COUNT = 3;
int settingsUiScreenCount = SETTINGS_UI_SCREEN_COUNT;

// --- Menu Ustawienia Buzera ---
int settingsBuzzerMenuIndex = 0;
const char* settingsBuzzerMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_BUZZER_MENU_COUNT = 2;
int settingsBuzzerMenuCount = SETTINGS_BUZZER_MENU_COUNT;

// --- Menu Ustawienia MQTT ---
int settingsMqttMenuIndex = 0;
const char* settingsMqttMenuItems[] = {
  "Wlaczony",
  "Wylaczony"
};
constexpr int SETTINGS_MQTT_MENU_COUNT = 2;
int settingsMqttMenuCount = SETTINGS_MQTT_MENU_COUNT;

static void drawHomeThrottled() {
  HomeRuntime::markHomeDirty();
  HomeRuntime::serviceRedraw(appState);
}

void setHomeUiProfile(uint8_t profileIndex) {
  HomeRuntime::setProfile(profileIndex);
  settingsUiScreenIndex = (int)HomeRuntime::getProfile();
}

static bool looksLikePlaceholder(const String& value) {
  return value.length() == 0 || value.startsWith("REPLACE_");
}

static void loadNetworkConfigFromPreferences() {
  s_wifiSsid = s_prefs.isKey("wifiSsid") ? s_prefs.getString("wifiSsid", PROJECT_WIFI_SSID) : PROJECT_WIFI_SSID;
  s_wifiPass = s_prefs.isKey("wifiPass") ? s_prefs.getString("wifiPass", PROJECT_WIFI_PASS) : PROJECT_WIFI_PASS;
  s_ntpServer = s_prefs.isKey("ntpServer") ? s_prefs.getString("ntpServer", PROJECT_NTP_SERVER) : PROJECT_NTP_SERVER;

  s_mqttConfig.brokerAddress = s_prefs.isKey("mqttHost") ? s_prefs.getString("mqttHost", PROJECT_MQTT_BROKER) : PROJECT_MQTT_BROKER;
  s_mqttConfig.brokerPort = (uint16_t)s_prefs.getUShort("mqttPort", PROJECT_MQTT_PORT);
  s_mqttConfig.username = s_prefs.isKey("mqttUser") ? s_prefs.getString("mqttUser", PROJECT_MQTT_USERNAME) : PROJECT_MQTT_USERNAME;
  s_mqttConfig.password = s_prefs.isKey("mqttPass") ? s_prefs.getString("mqttPass", PROJECT_MQTT_PASSWORD) : PROJECT_MQTT_PASSWORD;
  s_mqttConfig.topic = s_prefs.isKey("mqttTopic") ? s_prefs.getString("mqttTopic", PROJECT_MQTT_TOPIC) : PROJECT_MQTT_TOPIC;
  s_mqttConfig.clientId = s_prefs.isKey("mqttClient") ? s_prefs.getString("mqttClient", PROJECT_MQTT_CLIENT_ID) : PROJECT_MQTT_CLIENT_ID;

  if (looksLikePlaceholder(s_wifiSsid) || looksLikePlaceholder(s_wifiPass)) {
    LOG_W(TAG_MAIN, "WiFi credentials are placeholders config_keys=wifiSsid,wifiPass");
  }

  if (looksLikePlaceholder(s_mqttConfig.brokerAddress) ||
      looksLikePlaceholder(s_mqttConfig.username) ||
      looksLikePlaceholder(s_mqttConfig.password)) {
    LOG_W(TAG_MAIN, "MQTT credentials are placeholders config_keys=mqttHost,mqttUser,mqttPass");
  }
}

void startAlarmMelodyDemo(uint8_t melodyIndex) {
  ClockAlarmService::startAlarmMelodyDemo(melodyIndex, BUZZER_PIN);
}

void stopAlarmMelodyDemo() {
  ClockAlarmService::stopAlarmMelodyDemo(BUZZER_PIN);
}

// --- Heap Usage Tracking (used by system resources view) ---
uint8_t heapUsagePercent = 0;
uint8_t heapUsageCore0Percent = 0;
uint8_t heapUsageCore1Percent = 0;
static unsigned long lastCpuReadTime = 0;

// --- System Resources Tracking ---
uint32_t ramFreeBytes = 0;
uint32_t ramTotalBytes = 0;
uint32_t ramLargestBlockBytes = 0;
uint32_t ramMinFreeBytes = 0;
uint32_t ramDmaFreeBytes = 0;
uint32_t flashFreeBytes = 0;

// --- Ustawienia (Configuration settings) ---
bool buzzerEnabled = true;    // Czy buzzer jest włączony

// --- Budzik ---
int  alarmHour       = 7;
int  alarmMinute     = 0;
bool alarmEnabled    = false;
bool alarmRinging    = false;
unsigned long alarmStartTime  = 0;

// --- Multi-alarm storage ---
const int MAX_ALARMS = 8;
AlarmEntry alarms[MAX_ALARMS];
int alarmsCount = 0; // number of configured alarms
int alarmsMenuIndex = 0; // selection in list view
int selectedAlarmIndex = 0; // index for editing/deleting
int alarmEditCursor = 0; // 0=CZAS,1=STATUS,2=USUN

// --- Minutnik (Timer) ---
int  timerSetMinutes  = 0;    // ustawiane przez użytkownika
int  timerSetSeconds  = 0;
bool timerRunning     = false;
unsigned long timerStartMillis = 0;
unsigned long timerDurationMs  = 0;

int  timerSetHours    = 0;
int  timerUiCursor    = 0; // 0=CZAS, 1=PRESETY
int  timerPresetIndex = 1; // default highlight: 15m

// --- STM32 DANE (UART) ---
int  displayedBPM    = 0;
int  displayedSPO2   = 0;
bool stm32Connected  = false;

// --- Stoper ---
bool stoperRunning         = false;
unsigned long stoperStart  = 0;
unsigned long stoperElapsed = 0;

// --- Czas (HH:MM:SS) ---
int hours   = 12;
int minutes = 0;
int seconds = 0;
unsigned long lastTick = 0;

// --- MQTT Mode Control ---
bool mqttEnabled = true;

struct MainRuntimeState {
  bool bootDiagReprinted = false;
  unsigned long lastSTM32Update = 0;
  unsigned long lastSTM32DataReceived = 0;
  unsigned long lastStoperDraw = 0;
};

static MainRuntimeState s_runtimeState;

struct LoopBaselineTelemetry {
  unsigned long windowStartedMs = 0;
  unsigned long loopCount = 0;
  uint32_t lastLoopStartUs = 0;
  uint32_t lastLoopPeriodUs = 0;
  uint32_t minLoopPeriodUs = 0xFFFFFFFFUL;
  uint32_t maxLoopPeriodUs = 0;
  uint32_t maxLoopJitterUs = 0;
  uint32_t maxLoopBodyUs = 0;
  uint32_t maxUiRefreshUs = 0;
  uint32_t maxMqttPublishUs = 0;
  uint32_t maxNetworkUpdateUs = 0;
  uint32_t minFreeHeapBytes = 0xFFFFFFFFUL;
};

static LoopBaselineTelemetry s_loopBaseline;

