Fese673/ZEGAR-ESP32/src/main.cpp
static uint32_t deltaUs(uint32_t startUs, uint32_t endUs) {
  return (uint32_t)(endUs - startUs);
}

static uint32_t absDiffU32(uint32_t a, uint32_t b) {
  return (a >= b) ? (a - b) : (b - a);
}

static void recordMaxU32(uint32_t& target, uint32_t sample) {
  if (sample > target) {
    target = sample;
  }
}

static void baselineResetWindow(unsigned long nowMs) {
  s_loopBaseline.windowStartedMs = nowMs;
  s_loopBaseline.loopCount = 0;
  s_loopBaseline.minLoopPeriodUs = 0xFFFFFFFFUL;
  s_loopBaseline.maxLoopPeriodUs = 0;
  s_loopBaseline.maxLoopJitterUs = 0;
  s_loopBaseline.maxLoopBodyUs = 0;
  s_loopBaseline.maxUiRefreshUs = 0;
  s_loopBaseline.maxMqttPublishUs = 0;
  s_loopBaseline.maxNetworkUpdateUs = 0;
  s_loopBaseline.minFreeHeapBytes = 0xFFFFFFFFUL;
}

static void baselineOnLoopStart(unsigned long nowMs, uint32_t nowUs) {
  if (s_loopBaseline.windowStartedMs == 0) {
    baselineResetWindow(nowMs);
  }

  if (s_loopBaseline.lastLoopStartUs != 0) {
    const uint32_t periodUs = deltaUs(s_loopBaseline.lastLoopStartUs, nowUs);
    if (periodUs < s_loopBaseline.minLoopPeriodUs) {
      s_loopBaseline.minLoopPeriodUs = periodUs;
    }
    if (periodUs > s_loopBaseline.maxLoopPeriodUs) {
      s_loopBaseline.maxLoopPeriodUs = periodUs;
    }
    if (s_loopBaseline.lastLoopPeriodUs != 0) {
      const uint32_t jitterUs = absDiffU32(periodUs, s_loopBaseline.lastLoopPeriodUs);
      if (jitterUs > s_loopBaseline.maxLoopJitterUs) {
        s_loopBaseline.maxLoopJitterUs = jitterUs;
      }
    }
    s_loopBaseline.lastLoopPeriodUs = periodUs;
  }

  s_loopBaseline.lastLoopStartUs = nowUs;
  const uint32_t freeHeap = ESP.getFreeHeap();
  if (freeHeap < s_loopBaseline.minFreeHeapBytes) {
    s_loopBaseline.minFreeHeapBytes = freeHeap;
  }
}

static void baselineOnLoopEnd(unsigned long nowMs, uint32_t loopStartUs, uint32_t loopEndUs) {
  recordMaxU32(s_loopBaseline.maxLoopBodyUs, deltaUs(loopStartUs, loopEndUs));
  ++s_loopBaseline.loopCount;

  if ((nowMs - s_loopBaseline.windowStartedMs) < BASELINE_REPORT_WINDOW_MS) {
    return;
  }

  const uint32_t minPeriodUs = (s_loopBaseline.minLoopPeriodUs == 0xFFFFFFFFUL) ? 0UL : s_loopBaseline.minLoopPeriodUs;
  const uint32_t minHeapBytes = (s_loopBaseline.minFreeHeapBytes == 0xFFFFFFFFUL) ? ESP.getFreeHeap() : s_loopBaseline.minFreeHeapBytes;
    LOG_I(TAG_BASELINE,
      "Window complete window_ms=%lu loops=%lu loop_us_min=%lu loop_us_max=%lu loop_us_jitter=%lu body_max_us=%lu ui_max_us=%lu net_max_us=%lu mqtt_max_us=%lu heap_min_b=%lu",
      (unsigned long)(nowMs - s_loopBaseline.windowStartedMs),
      s_loopBaseline.loopCount,
      (unsigned long)minPeriodUs,
      (unsigned long)s_loopBaseline.maxLoopPeriodUs,
      (unsigned long)s_loopBaseline.maxLoopJitterUs,
      (unsigned long)s_loopBaseline.maxLoopBodyUs,
      (unsigned long)s_loopBaseline.maxUiRefreshUs,
      (unsigned long)s_loopBaseline.maxNetworkUpdateUs,
      (unsigned long)s_loopBaseline.maxMqttPublishUs,
      (unsigned long)minHeapBytes);

  baselineResetWindow(nowMs);
}

struct RuntimeContext {
  int& hours;
  int& minutes;
  int& seconds;
  unsigned long& lastTick;
  bool& mqttEnabled;
  int& settingsRotationSec;
  int& settingsUiScreenIndex;
  int& settingsMqttMenuIndex;
  int& settingsAlarmMelodyIndex;
  int& prevSettingsAlarmMelodyIndex;
  int& prevSettingsRotationSec;
  int& prevSettingsUiScreenIndex;
  int& alarmsCount;
  MainRuntimeState& state;
};

static RuntimeContext makeRuntimeContext() {
  return RuntimeContext{
      hours,
      minutes,
      seconds,
      lastTick,
      mqttEnabled,
      settingsRotationSec,
      settingsUiScreenIndex,
      settingsMqttMenuIndex,
      settingsAlarmMelodyIndex,
      s_prevSettingsAlarmMelodyIndex,
      s_prevSettingsRotationSec,
      s_prevSettingsUiScreenIndex,
      alarmsCount,
      s_runtimeState,
  };
}

static bool restoreRtcHandoffTime(RuntimeContext& ctx, unsigned long nowMs, bool refreshHomeUi);

static void initCoreHardware();
static void initPersistenceAndConfig(RuntimeContext& ctx);
static void initUiAndInput();
static void initSensors(RuntimeContext& ctx);
static void initComms(RuntimeContext& ctx);
static void finalizeStartup(RuntimeContext& ctx);

static void serviceBootDiagnostics(RuntimeContext& ctx, unsigned long nowMs);
static void serviceInputAndUiEvents(RuntimeContext& ctx, unsigned long nowMs);
static void serviceUiRefreshPreSensors(RuntimeContext& ctx, unsigned long nowMs);
static void serviceSensors(RuntimeContext& ctx, unsigned long nowMs);
static void serviceUiRefresh(RuntimeContext& ctx, unsigned long nowMs);
static void serviceDiagnostics(RuntimeContext& ctx, unsigned long nowMs);
static void serviceComms(RuntimeContext& ctx, unsigned long nowMs);
static void serviceStm32AndStopwatch(RuntimeContext& ctx, unsigned long nowMs);
static void serviceDiagnosticsTail(RuntimeContext& ctx, unsigned long nowMs);

// ============================================================================
// MONITOROWANIE ZASOBÓW SYSTEMU
// ============================================================================

void updateSystemResources() {
  unsigned long currentTime = millis();
  
  // Aktualizuj co ~1 sekundę
  if (currentTime - lastCpuReadTime < 1000) {
    return;
  }
  
  lastCpuReadTime = currentTime;
  
  // --- Heap usage ratio (historically shown on CPU screen) ---
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();

  uint32_t usedHeap = totalHeap - freeHeap;
  if (totalHeap == 0) {
    heapUsagePercent = 0;
  } else {
    heapUsagePercent = (uint8_t)((usedHeap * 100U) / totalHeap);
  }

  if (heapUsagePercent > 80) {
    heapUsageCore0Percent = heapUsagePercent - 5;
    heapUsageCore1Percent = heapUsagePercent;
  } else if (heapUsagePercent > 60) {
    heapUsageCore0Percent = heapUsagePercent + 5;
    heapUsageCore1Percent = heapUsagePercent - 5;
  } else {
    heapUsageCore0Percent = heapUsagePercent + 10;
    heapUsageCore1Percent = heapUsagePercent;
  }

  if (heapUsageCore0Percent > 100) heapUsageCore0Percent = 100;
  if (heapUsageCore1Percent > 100) heapUsageCore1Percent = 100;
  
  // --- RAM Free ---
  ramFreeBytes = freeHeap;
  ramTotalBytes = totalHeap;
  
#ifdef ARDUINO_ARCH_ESP32
  ramLargestBlockBytes = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
  ramMinFreeBytes = ESP.getMinFreeHeap();
  ramDmaFreeBytes = heap_caps_get_free_size(MALLOC_CAP_DMA);
#else
  ramLargestBlockBytes = 0;
  ramMinFreeBytes = ramFreeBytes;
  ramDmaFreeBytes = 0;
#endif

  // --- Flash Free ---
  flashFreeBytes = ESP.getFreeSketchSpace();
}

// ============================================================================
// SETUP
// ============================================================================

static bool restoreRtcHandoffTime(RuntimeContext& ctx, unsigned long nowMs, bool refreshHomeUi) {
  const uint8_t rtcHours = RadioModeSwitch::getRTCHours();
  const uint8_t rtcMinutes = RadioModeSwitch::getRTCMinutes();
  const uint8_t rtcSeconds = RadioModeSwitch::getRTCSeconds();

  if (rtcHours == 0 && rtcMinutes == 0 && rtcSeconds == 0) {
    return false;
  }

