Fese673/ZEGAR-ESP32/src/main.cpp
  if (rtcHours < 24 && rtcMinutes < 60 && rtcSeconds < 60) {
    ctx.hours = rtcHours;
    ctx.minutes = rtcMinutes;
    ctx.seconds = rtcSeconds;
    ctx.lastTick = nowMs;
    LOG_I(TAG_MAIN, "Restore time from RTC handoff hours=%02u minutes=%02u seconds=%02u", (unsigned)ctx.hours, (unsigned)ctx.minutes, (unsigned)ctx.seconds);
    updateSevenSeg();
    if (refreshHomeUi) {
      drawHomeThrottled();
    }
    RadioModeSwitch::clearRTCTime();
    return true;
  }

  LOG_W(TAG_MAIN, "Invalid RTC handoff time hours=%02u minutes=%02u seconds=%02u action=ignore", (unsigned)rtcHours, (unsigned)rtcMinutes, (unsigned)rtcSeconds);
  RadioModeSwitch::clearRTCTime();
  return false;
}

static void initCoreHardware() {
  Serial.begin(UART_BAUD);
  const unsigned long setupWaitUntilMs = millis() + SETUP_DELAY_MS;
  while ((long)(millis() - setupWaitUntilMs) < 0) {
    yield();
  }

  RtcSyncService::applyTimezone();
  heapBaseline = ESP.getFreeHeap();
  LOG_I(TAG_RAM, "Baseline heap free_b=%u", heapBaseline);
  ModeManager::logDiag("boot");
  RamTelemetry::begin();

  ModeManager::begin(&appState);
  RAM_CHECKPOINT("BOOT");

  // Ensure 7-seg GPIO is configured before any early time restoration.
  initSevenSeg();
}

static void initPersistenceAndConfig(RuntimeContext& ctx) {
  s_prefs.begin("zegar", false);
  loadNetworkConfigFromPreferences();
  showEpicIntro = s_prefs.getBool("epicIntro", true);
  settingsEpicIntroIndex = showEpicIntro ? 0 : 1;

  RadioModeSwitch::begin();
  restoreRtcHandoffTime(ctx, millis(), false);
}

static void initUiAndInput() {
#if UART_LCD_MIRROR
  lcdMirror.begin();
#endif
  lcdFrame.begin();

  const bool i2cClockApplied = I2cShared::initMaster(&Wire,
                                                     BoardPins::kI2cSda,
                                                     BoardPins::kI2cScl,
                                                     BoardPins::kI2cClockHz);
    LOG_I(TAG_I2C,
      "Clock readback requested_hz=%lu actual_hz=%lu status=%s",
      (unsigned long)BoardPins::kI2cClockHz,
      (unsigned long)Wire.getClock(),
      i2cClockApplied ? "applied" : "fallback_mismatch");
  RAM_CHECKPOINT("I2C_READY");

  RtcSyncService::tryRestoreSystemTimeFromDs3231(hours, minutes, seconds, lastTick);

  lcd.setExecTimes(37, 1520);
  lcd.init();
  lcd.backlight();
  lcd.clear();
  lcdFrame.syncToCurrentFrame();
  LCDIcons::loadPalette(lcd, LCDIcons::Palette::Home);

  const bool skipIntroAfterModeHandoff = RadioModeSwitch::wasBootHandoffDetected();
  if (showEpicIntro && !skipIntroAfterModeHandoff) {
    introBegin();
  } else if (showEpicIntro && skipIntroAfterModeHandoff) {
    LOG_I(TAG_MAIN, "Boot intro skipped reason=radio_mode_handoff_restart");
  }

  encoder_begin(ENC_CLK, ENC_DT, ENC_SW);
  pinMode(BUZZER_PIN, OUTPUT);
  statsManager.begin();
}

static void initSensors(RuntimeContext& ctx) {
  STM32data_begin(uart, UART_BAUD, BoardPins::kStm32UartRx, BoardPins::kStm32UartTx);

  PMS5003Sensor::begin();
  ENS160AHT21Screen::resetRuntimeData();
  ENS160AHT21Sensor::begin();
  BMP280Sensor::begin();
  bmp280MenuCount = BMP280Sensor::menuItemCount();
  RAM_CHECKPOINT("SENSORS_INIT");

  HomeRuntime::DrawCallbacks homeDrawCallbacks;
  homeDrawCallbacks.drawHome = drawHome;
  homeDrawCallbacks.drawIndoorWeather = drawIndoorWeatherScreen;
  homeDrawCallbacks.drawOutdoorAir = drawAirScreen;
  homeDrawCallbacks.drawExtremeEnvironment = drawExtremeEnvironmentScreen;
  homeDrawCallbacks.drawSystemResources = drawSystemResources;
  homeDrawCallbacks.drawExtremeAlgorithms = drawExtremeAlgorithmScreen;
  HomeRuntime::begin(homeDrawCallbacks, (uint8_t)ctx.settingsUiScreenIndex, (uint8_t)ctx.settingsRotationSec);
  RAM_CHECKPOINT("UI_READY");
}

static void initComms(RuntimeContext& ctx) {
  UI_Callbacks callbacks;
  callbacks.drawHome = drawHomeThrottled;
  callbacks.drawMenu = drawMenu;
  callbacks.drawSetTime = drawSetTime;
  callbacks.drawAlarm = drawAlarm;
  callbacks.drawTimer = drawTimer;
  callbacks.drawStoper = drawStoper;
  callbacks.drawDebugSTM32 = drawDebugSTM32;
  callbacks.updateSevenSeg = updateSevenSeg;
  callbacks.updateSevenSegStoper = updateSevenSegStoper;
  callbacks.drawStats = drawStats;
  callbacks.drawSystemResources = drawSystemResources;
  callbacks.setHomeUiProfile = setHomeUiProfile;

  lcdFrame.forceFullRedrawOnce();
  ui_begin(callbacks);
  lcd.backlight();

#if CORE_DEBUG_LEVEL > 0
  lcdFrame.reportTiming("startup");
#endif

  ctx.settingsRotationSec = s_prefs.getUShort("homeOverlaySec", (uint16_t)ctx.settingsRotationSec);
  if (ctx.settingsRotationSec < 1) ctx.settingsRotationSec = 1;
  if (ctx.settingsRotationSec > 10) ctx.settingsRotationSec = 10;
  HomeRuntime::setOverlayIntervalSeconds((uint8_t)ctx.settingsRotationSec);
  ctx.prevSettingsRotationSec = ctx.settingsRotationSec;

  ctx.settingsAlarmMelodyIndex = AlarmMelodyPrefs::loadIndex(s_prefs);
  ctx.prevSettingsAlarmMelodyIndex = ctx.settingsAlarmMelodyIndex;

  ctx.settingsUiScreenIndex = (int)s_prefs.getUShort("uiScreenMode", (uint16_t)ctx.settingsUiScreenIndex);
  if (ctx.settingsUiScreenIndex < 0) ctx.settingsUiScreenIndex = 0;
  if (ctx.settingsUiScreenIndex > 2) ctx.settingsUiScreenIndex = 2;
  setHomeUiProfile((uint8_t)ctx.settingsUiScreenIndex);
  ctx.prevSettingsUiScreenIndex = ctx.settingsUiScreenIndex;

  ctx.mqttEnabled = s_prefs.getBool("mqttEnabled", true);
  ctx.settingsMqttMenuIndex = ctx.mqttEnabled ? 0 : 1;

  ctx.alarmsCount = s_prefs.getUShort("alarmCount", 0);
  if (ctx.alarmsCount < 0) ctx.alarmsCount = 0;
  if (ctx.alarmsCount > MAX_ALARMS) ctx.alarmsCount = MAX_ALARMS;
  for (int i = 0; i < ctx.alarmsCount; ++i) {
    char keyH[12];
    char keyM[12];
    char keyE[12];
    snprintf(keyH, sizeof(keyH), "a%dh", i);
    snprintf(keyM, sizeof(keyM), "a%dm", i);
    snprintf(keyE, sizeof(keyE), "a%de", i);
    alarms[i].hour = (uint8_t)s_prefs.getUShort(keyH, 7);
    alarms[i].minute = (uint8_t)s_prefs.getUShort(keyM, 0);
    alarms[i].enabled = s_prefs.getBool(keyE, true);
    alarms[i].lastTriggerDay = 0;
  }

