Fese673/ZEGAR-ESP32/src/main.cpp
  WiFiSync::setTimeRefs(ctx.hours, ctx.minutes, ctx.seconds, ctx.lastTick);
  WiFiSync::setOnDone([]() {
    const unsigned long ntpSyncMs = WiFiSync::getLastNtpSyncTime();
    RtcSyncService::noteNtpSync(ntpSyncMs);
    drawHomeThrottled();
  });
  WiFiSync::begin(s_wifiSsid.c_str(), s_wifiPass.c_str(), s_ntpServer.c_str());

  MQTTSync::configure(s_mqttConfig);

  NetworkOrchestrator::Config netCfg;
  netCfg.wifiSsid = s_wifiSsid.c_str();
  netCfg.wifiPass = s_wifiPass.c_str();
  netCfg.wifiStatusCheckMs = 2000UL;
  NetworkOrchestrator::begin(netCfg);
  NetworkOrchestrator::setMqttEnabled(ctx.mqttEnabled);
  LOG_I(TAG_NET, "Network orchestrator armed services=wifi,radio,mqtt");
  RAM_CHECKPOINT("NETWORK_INIT");
}

static void finalizeStartup(RuntimeContext& ctx) {
  (void)ctx;
  if (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }

  ModeManager::logDiag("after-setup-radio-ready");
  RAM_CHECKPOINT("SETUP_DONE");
}

void setup() {
  RuntimeContext ctx = makeRuntimeContext();
  initCoreHardware();
  initPersistenceAndConfig(ctx);
  initUiAndInput();
  initSensors(ctx);
  initComms(ctx);
  finalizeStartup(ctx);
}

// ============================================================================
// LOOP SERVICES (ETAP 1)
// ============================================================================

static void serviceBootDiagnostics(RuntimeContext& ctx, unsigned long nowMs) {
  if (!ctx.state.bootDiagReprinted && nowMs >= 5000UL) {
    ctx.state.bootDiagReprinted = true;
    LOG_I(TAG_MAIN,
          "Boot serial alive i2c_hz=%lu heap_b=%u",
          (unsigned long)Wire.getClock(),
          ESP.getFreeHeap());
  }
}

static void serviceInputAndUiEvents(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  HomeRuntime::handleHomeEntryIfStateChanged(appState);

  while (true) {
    const EncoderEvent evt = encoder_update();
    if (evt == ENC_NONE) {
      break;
    }

    if (evt == ENC_CLICK || evt == ENC_LONG) {
      statsManager.registerClick();
    } else if (evt == ENC_LEFT) {
      statsManager.registerStepLeft();
    } else if (evt == ENC_RIGHT) {
      statsManager.registerStepRight();
    }

    if (!RadioModeSwitch::isInitializing()) {
      ui_handleEvent(evt);
    }
  }

  statsManager.update();
}

static void serviceUiRefreshPreSensors(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  const uint32_t refreshStartUs = micros();
  HomeRuntime::serviceOverlayRotation(appState);
  HomeRuntime::serviceRedraw(appState);
  recordMaxU32(s_loopBaseline.maxUiRefreshUs, deltaUs(refreshStartUs, micros()));
}

static void serviceSensors(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  (void)nowMs;
  updateSystemResources();
  PMS5003Sensor::update();
  ENS160AHT21Sensor::update();
  BMP280Sensor::update();
}

static void serviceUiRefresh(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  const uint32_t refreshStartUs = micros();

  static unsigned long lastStatsRedraw = 0;
  if ((appState == STATE_STATS_RESOURCES_CPU || appState == STATE_STATS_RESOURCES_RAM ||
       appState == STATE_STATS_RESOURCES_FLASH || appState == STATE_STATS_RESOURCES ||
       appState == STATE_PMS5003_CF1 || appState == STATE_PMS5003_CF1_PM1 || appState == STATE_PMS5003_CF1_PM25 || appState == STATE_PMS5003_CF1_PM10 ||
       appState == STATE_PMS5003_ATM || appState == STATE_PMS5003_ATM_PM1 || appState == STATE_PMS5003_ATM_PM25 || appState == STATE_PMS5003_ATM_PM10 ||
       appState == STATE_PMS5003_PARTICLES || appState == STATE_PMS5003_PARTICLES_0_3 || appState == STATE_PMS5003_PARTICLES_0_5 || appState == STATE_PMS5003_PARTICLES_1_0 || appState == STATE_PMS5003_PARTICLES_2_5 || appState == STATE_PMS5003_PARTICLES_5_0 || appState == STATE_PMS5003_PARTICLES_10_0 ||
       appState == STATE_PMS5003_TELEMETRY ||
       appState == STATE_ENS160_AHT21 || appState == STATE_ENS160_AHT21_SUMMARY || appState == STATE_ENS160_AHT21_GAS ||
       appState == STATE_ENS160_AHT21_GAS_AQI || appState == STATE_ENS160_AHT21_GAS_TVOC || appState == STATE_ENS160_AHT21_GAS_ECO2 ||
       appState == STATE_ENS160_AHT21_CLIMATE || appState == STATE_ENS160_AHT21_CLIMATE_TEMP || appState == STATE_ENS160_AHT21_CLIMATE_HUM ||
       appState == STATE_ENS160_AHT21_STATUS ||
       appState == STATE_BMP280 || appState == STATE_BMP280_TEMP || appState == STATE_BMP280_PRESSURE ||
       appState == STATE_BMP280_STATUS || appState == STATE_BMP280_ALTITUDE) &&
      (nowMs - lastStatsRedraw >= 1000UL)) {
    lastStatsRedraw = nowMs;
    drawStats();
  }

  static unsigned long lastTimerRedraw = 0;
  if (appState == STATE_TIMER && (nowMs - lastTimerRedraw >= 1000UL)) {
    lastTimerRedraw = nowMs;
    if (timerRunning || editState == EDIT_DONE) {
      drawTimer();
    }
  }

  recordMaxU32(s_loopBaseline.maxUiRefreshUs, deltaUs(refreshStartUs, micros()));
}

static void serviceDiagnostics(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  static unsigned long last_status_diag = 0;
  if (!ModeManager::isBtOn() && (nowMs - last_status_diag >= 2000UL)) {
    last_status_diag = nowMs;
    static uint32_t last_heap = 0;
    const uint32_t current_heap = ESP.getFreeHeap();
    const int heap_delta = (int)current_heap - (int)last_heap;
    last_heap = current_heap;

    LOG_I(TAG_MAIN,
          "Status wifi=%s mqtt=%s bt=%s heap_b=%u delta_b=%+d mode=%s",
          ModeManager::isWifiOn() ? "ON" : "OFF",
          NetworkOrchestrator::isMqttInitialized() ? "ON" : "OFF",
          ModeManager::isBtOn() ? "ON" : "OFF",
          current_heap,
          heap_delta,
          (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) ? "BT" : "WiFi");
  }

#if ENABLE_RUNTIME_TELEMETRY
  RuntimeTelemetry::service(Serial, nowMs);
#endif

  RamTelemetry::service(Serial, nowMs);

#if CORE_DEBUG_LEVEL > 0
  static bool lcdTimingPrimed = false;
  static unsigned long lastLcdTimingReport = 0;
  constexpr unsigned long LCD_TIMING_WINDOW_MS = 30000UL;
  if (!lcdTimingPrimed && nowMs >= LCD_TIMING_WINDOW_MS) {
    lcdFrame.resetStats();
    lcdTimingPrimed = true;
    lastLcdTimingReport = nowMs;
  }
  if (lcdTimingPrimed && (nowMs - lastLcdTimingReport >= LCD_TIMING_WINDOW_MS)) {
    lastLcdTimingReport = nowMs;
    lcdFrame.reportTiming("runtime");
    lcdFrame.resetStats();
  }
#endif
}

static void serviceComms(RuntimeContext& ctx, unsigned long nowMs) {
  ClockAlarmService::tickClock(CLOCK_TICK_MS, BUZZER_PIN);
  ClockAlarmService::serviceAlarmPlayback(BUZZER_PIN, ALARM_DURATION_MS);

  NetworkOrchestrator::setMqttEnabled(ctx.mqttEnabled);
  const uint32_t netStartUs = micros();
  NetworkOrchestrator::update();
  recordMaxU32(s_loopBaseline.maxNetworkUpdateUs, deltaUs(netStartUs, micros()));

  RtcSyncService::processPendingWrite();

  if (ctx.mqttEnabled && NetworkOrchestrator::isMqttInitialized()) {
    static unsigned long lastMQTTPublish = 0;
    if (nowMs - lastMQTTPublish >= 5000UL) {
      lastMQTTPublish = nowMs;
      const uint32_t mqttStartUs = micros();
      TelemetryComposer::Sample sample;
      TelemetryComposer::buildMqttTelemetrySample(sample);
      MQTTSync::publishSensorData(sample.temperatureC,
                                  sample.humidityPct,
                                  sample.pressureHpa,
                                  sample.aqi,
                                  sample.tvoc,
                                  sample.eco2);
      recordMaxU32(s_loopBaseline.maxMqttPublishUs, deltaUs(mqttStartUs, micros()));
    }
  }

