Fese673/ZEGAR-ESP32/src/main.cpp
  if (NetworkOrchestrator::getCurrentRadioState() == RADIO_STATE_BT) {
    radioMode = BT_ONLY;
  } else {
    radioMode = WIFI_ONLY;
  }
}

static void serviceStm32AndStopwatch(RuntimeContext& ctx, unsigned long nowMs) {
  if (appState == STATE_DEBUG_STM32 && (nowMs - ctx.state.lastSTM32Update >= STM32_UPDATE_MS)) {
    ctx.state.lastSTM32Update = nowMs;
    STM32data_update();

    if (stmDataUpdated) {
      stmDataUpdated = false;
      displayedBPM = bpmNumber;
      displayedSPO2 = spo2Number;
      stm32Connected = true;
      ctx.state.lastSTM32DataReceived = nowMs;
    } else if (nowMs - ctx.state.lastSTM32DataReceived > STM32_TIMEOUT_MS) {
      stm32Connected = false;
      displayedBPM = 0;
      displayedSPO2 = 0;
    }

    drawDebugSTM32();
  }

  if (appState == STATE_STOPER && (nowMs - ctx.state.lastStoperDraw >= STOPER_DRAW_MS)) {
    ctx.state.lastStoperDraw = nowMs;
    drawStoper();
  }
}

static void serviceDiagnosticsTail(RuntimeContext& ctx, unsigned long nowMs) {
  (void)ctx;
  static unsigned long lastBtCheck = 0;
  if (nowMs - lastBtCheck > 60000UL) {
    lastBtCheck = nowMs;
    LOG_I(TAG_BT, "Connected=%s", audioBT_isConnected() ? "yes" : "no");
  }
}

// ============================================================================
// LOOP
// ============================================================================

void loop() {
  if (serviceEpicBootSequence()) {
    return;
  }

  static RuntimeContext ctx = makeRuntimeContext();
  const unsigned long nowMs = millis();
  const uint32_t loopStartUs = micros();
  baselineOnLoopStart(nowMs, loopStartUs);

  serviceBootDiagnostics(ctx, nowMs);
  serviceInputAndUiEvents(ctx, nowMs);
  serviceUiRefreshPreSensors(ctx, nowMs);
  serviceSensors(ctx, nowMs);
  serviceUiRefresh(ctx, nowMs);
  serviceDiagnostics(ctx, nowMs);
  serviceComms(ctx, nowMs);
  serviceStm32AndStopwatch(ctx, nowMs);
  serviceDiagnosticsTail(ctx, nowMs);

  baselineOnLoopEnd(nowMs, loopStartUs, micros());
}
